# pyuic5
# Сделать команды бота по типу словаря:
''' {"Погода": get_weather(),
    "Помощь": help(),
    "Статус": server_status(),
    "Пользователи в бане": get_banned(),
    "Генератор пароля": generate_password(),
    "Подбросить монетку": flip_coin()
'''
'''
Функционал:
- Приветствие нового пользователя
- Правила чата
- Бан-лист
'''
# Сделать красивый интерфейс
# Кидать запрос на приглашение
# Определиться с хэш функцией(md5 без расшифровки или SHA-256)
'''
servers = {
    "testServer":[
        messages{
            'username': "ff",
            'text': "hello",
            'timestamp': 22.12.2020
        },
        users{
            "Leha":
            {
                "password": "555",
                "online": True
            }
        },
        admins["Leha"]
    ]
}
'''
